app/controllers/pages_controller.rb

SELECT "sections".* FROM "sections" WHERE "sections"."nombre" = 'inicio' LIMIT 1
SELECT "areas".* FROM "areas" WHERE "areas"."nombre" = 'Slide 1' LIMIT 1
---
	def inicio
		@titulo = 'inicio'
		@textos  = Section.find_by_nombre("inicio").phrases
		@imagen1 =Area.find_by_nombre("Inicio Principal")

SELECT "sections".* FROM "sections" WHERE "sections"."nombre" = 'nosotros' LIMIT 1
SELECT "areas".* FROM "areas" WHERE "areas"."nombre" = 'Fondo nosotros' LIMIT 1
---
	def nosotros
		@titulo = 'contacto'
		@fondo = '#78cc40'
		@textos  = Section.find_by_nombre("nosotros").phrases
		@imagenfondo =Area.find_by_nombre("Fondo nosotros")

SELECT "sections".* FROM "sections" WHERE "sections"."nombre" = 'aeroshow' LIMIT 1
---
	def aeroshow
		@titulo = 'aeroshow'
		@textos  = Section.find_by_nombre("aeroshow").phrases